const schedule = require("node-schedule");

module.exports.config = {
  name: "ajan",
  version: "1.0.0",
  permission: 0,
  credits: "RAKIB BOSS",
  description: "নির্ধারিত সময়ে নামাজের বার্তা পাঠাবে",
  category: "automessage",
  usages: "",
  cooldowns: 5,
  prefix: "+"
};

module.exports.onLoad = function ({ api }) {
  const messages = [
    {
      time: "5:00",
      message: `╭•┄┅══❁🪷❁══┅┄•╮
•—»✨ফজরে আজান✨«—•
╰•┄┅══❁🪷❁══┅┄•╯

⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆
🫡 আসসালামু আলাইকুম-!!🖤💫 প্রিয় মুসলিম ভাই ও বোন এখন ফজরের আজান দেওয়া হয়েছে সবাই নামাজ এর জন্য প্রস্তুতি নিয়ে নিন আর কিছু সময় বাকি ফজর এর নামাজ শুরু হয়ে যাবে-!!✨
⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆

╭─╼╾═ঔৣ۝ঔৣ═╼╾─╮ 
🌹  —͟͟͞͞AR Ramisha    🌹
╰─╼╾═ঔৣ۝ঔৣ═╼╾─╯`
    },
    {
      time: "1:00",
      message: `╭•┄┅══❁🪷❁══┅┄•╮
•—»✨যোহর-এর আজান✨«—•
╰•┄┅══❁🪷❁══┅┄•╯

⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆
আসসালামু আলাইকুম-!!🖤💫
প্রিয় মুসলিম ভাই ও বোন এখন যোহরের আজান দেওয়া হয়েছে সবাই নামাজ এর জন্য প্রস্তুতি নিয়ে নিন আর কিছু সময় বাকি যোহর এর নামাজ শুরু হয়ে যাবে-!!✨
⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆

╭─╼╾═ঔৣ۝ঔৣ═╼╾─╮ 
🌹  —͟͟͞͞AR Ramisha    🌹
╰─╼╾═ঔৣ۝ঔৣ═╼╾─╯`
    },
    {
      time: "4:45",
      message: `╭•┄┅══❁🪷❁══┅┄•╮
•—»✨আছর-এর আজান✨«—•
╰•┄┅══❁🪷❁══┅┄•╯

⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆
আসসালামু আলাইকুম-!!🖤💫
প্রিয় মুসলিম ভাই ও বোন এখন আছর-এর আজান দেওয়া হয়েছে সবাই নামাজ এর জন্য প্রস্তুতি নিয়ে নিন আর কিছু সময় বাকি আছর এর নামাজ শুরু হয়ে যাবে-!!✨
⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆

╭─╼╾═ঔৣ۝ঔৣ═╼╾─╮ 
🌹  —͟͟͞͞AR Ramisha    🌹
╰─╼╾═ঔৣ۝ঔৣ═╼╾─╯`
    },
    {
      time: "7:00",
      message: `╭•┄┅══❁🪷❁══┅┄•╮
•—»✨মাগরিব-এর আজান✨«—•
╰•┄┅══❁🪷❁══┅┄•╯

⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆
আসসালামু আলাইকুম-!!🖤💫
প্রিয় মুসলিম ভাই ও বোন এখন মাগরিব-এর আজান দেওয়া হয়েছে সবাই নামাজ এর জন্য প্রস্তুতি নিয়ে নিন আর কিছু সময় বাকি মাগরিব এর নামাজ শুরু হয়ে যাবে-!!✨
⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆

╭─╼╾═ঔৣ۝ঔৣ═╼╾─╮ 
🌹  —͟͟͞͞AR Ramisha    🌹
╰─╼╾═ঔৣ۝ঔৣ═╼╾─╯`
    },
    {
      time: "7:30",
      message: `╭•┄┅══❁🪷❁══┅┄•╮
•—»✨এশা-এর আজান✨«—•
╰•┄┅══❁🪷❁══┅┄•╯

⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆
আসসালামু আলাইকুম-!!🖤💫
প্রিয় মুসলিম ভাই ও বোন এখন এশা-এর আজান দেওয়া হয়েছে সবাই নামাজ এর জন্য প্রস্তুতি নিয়ে নিন আর কিছু সময় বাকি এশা এর নামাজ শুরু হয়ে যাবে-!!✨
⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆

╭─╼╾═ঔৣ۝ঔৣ═╼╾─╮ 
🌹  —͟͟͞͞AR Ramisha    🌹
╰─╼╾═ঔৣ۝ঔৣ═╼╾─╯`
    }
  ];

  const threadID = global.azanGroup || null;

  for (let item of messages) {
    const [hour, minute] = item.time.split(":").map(Number);
    schedule.scheduleJob({ hour, minute, tz: "Asia/Dhaka" }, function () {
      if (threadID) {
        api.sendMessage(item.message, threadID);
      }
    });
  }
};

module.exports.run = () => {};
