module.exports = {
  config: {
    name: "islamfamelyrules",
    version: "1.0.0",
    permission: 1, // শুধুমাত্র Admin
    credits: "Rakib Boss",
    description: "ইসলামিক গ্রুপের নিয়মাবলী দেখাবে",
    category: "group",
    usages: "",
    cooldowns: 5,
  },

  run: async function ({ api, event }) {
    const message = `
╭•┄┅══❁🌻❁══┅┄•╮
✪ اسلامو الیکوم ورحمتللاحی وابارکات ﷼ ✪
╰•┄┅══❁🌻❁══┅┄•╯

প্রিয়ো গ্রুপবাসি, আশা করি সবাই ভালো আছেন। আলহামদুলিল্লাহ আমিও ভালো আছি 🥰

আমাদের এই ✮⃝💖ই্সঁলা্ঁমি্ঁক্ 🕋𝄟পরিবার 💜মিউজিক𝄟💙 ব্যান্ড গ্রুপের নিয়মাবলী ⛦

1️⃣ এটি একটি ইসলামিক গ্রুপ, এখানে শুধু ইসলামিক ভিডিও, ক্যাপশন ছাড়া অন্য কিছু এলাউ না 🌺

2️⃣ আমরা সবাই প্রিয় নবিজীর উম্মত, তাই কারো সাথে বাজে কথা না বলার অনুরোধ 🙏

3️⃣ ছোট বড় সবাইকে সম্মান দিয়ে কথা বলব, কারণ এটি আমাদের নবিজির আদর্শ 🥰

4️⃣ দিন দিন অনেক খারাপের ভিতর ঢুকে পড়ছি, তাই শয়তানের পথ থেকে দূরে থাকব, কারণ সে আমাদের জাহান্নামের দিকে টানে 😭🌺

5️⃣ আসুন আমরা সবাই মিলে ইসলাম ধর্মের পথে থাকার চেষ্টা করি। এজন্যই এই গ্রুপ খোলা হয়েছে 🤗

6️⃣ এখানে কেউ ইসলামিক বিষয় ছাড়া অন্য কোন বিষয় আলোচনা করতে পারবে না 🤷‍♀️

7️⃣ আপনার মন চাইলে পোস্ট করতে পারেন, তবে বিষয়বস্তু অবশ্যই ইসলামিক হতে হবে।

8️⃣ পোস্টে রিয়্যাক্ট না দিলে সরাসরি কিক দেওয়া হবে ⚔️

🚫 উপরোক্ত নিয়ম লঙ্ঘন করলে অ্যাডমিন বাধ্য হয়ে কিক দিতে পারেন।

💖 আমরা কৃতজ্ঞ যে আমরা একটি ইসলামিক পরিবারে আছি, কেউ এই গ্রুপ ছেড়ে যাব না ইনশাআল্লাহ 🥰🌺🙏

🤲 আল্লাহ আমাদের সবাইকে ইসলামি পথে অটল থাকার তৌফিক দান করুন। আমিন।

╭•┄┅══❁🌻❁══┅┄•╮
✪ MADE BY RAKIB BOSS ✪ 
╰•┄┅══❁🌻❁══┅┄•╯
    `;

    return api.sendMessage(message, event.threadID, event.messageID);
  }
};
